snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ДопИнфо/ДопИнфо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДопИнфо</name>
  <resources>
    <name>ЗначениеИнфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидИнфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/CommonModules/Привелигированный/Module.bsl
//ИСТОРИЯ
Функция УстановитьПериодическийРеквизит(Объект,ИмяРеквизита,Значение,Дата2,Документ=Неопределено) Экспорт
	Запись=РегистрыСведений.История.СоздатьМенеджерЗаписи();	
	
	Запись.Объект	=Объект;
	Запись.Реквизит	=ИмяРеквизита;
	Запись.Значение	=Значение;
	Запись.Период	=Дата2;
	Запись.Документ	=Документ;
	
	Запись.Записать();
КонецФункции // УстановитьПериодичесткийРеквизит()
 
Функция ПолучитьПериодическийРеквизит(Объект,ИмяРеквизита,Знач Дата2=Неопределено,КодИБ=Неопределено,ДатаРеквизита="",отбор=Неопределено) Экспорт
	Дата2=?(Дата2=Неопределено,ТекущаяДата(),Дата2);
	
	Запрос=Новый Запрос;
	Если КодИБ=Неопределено Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Значение,Период
		|ИЗ
		|	РегистрСведений.История.СрезПоследних(&Дата2,Объект = &Объект И Реквизит = &Реквизит)
		|УПОРЯДОЧИТЬ ПО	Период УБЫВ";		
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Значение,Период
		|ИЗ
		|	РегистрСведений.История
		|ГДЕ 
		|	Объект = &Объект И Реквизит = &Реквизит И Период<=&Дата2 И Значение.Владелец.Код=&КодИБ	
		|УПОРЯДОЧИТЬ ПО	Период УБЫВ";			
		
		Запрос.УстановитьПараметр("КодИБ",КодИБ);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	Запрос.УстановитьПараметр("Объект",Объект);
	Запрос.УстановитьПараметр("Реквизит",ИмяРеквизита);
	
	Выборка=Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		//Кухарь 18.11.16 начало
		//Для отбора
		//Функция ПолучитьГрупповойПериодическийРеквизит(Ссылка,ИмяРеквизита,Знач Дата2=Неопределено)	Экспорт
		если отбор<>Неопределено  тогда
			если Выборка.Значение.странапроисхождения<>Отбор.Страна тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//Кухарь 18.11.16 конец
		
		ДатаРеквизита=Выборка.Период;
		Возврат Выборка.Значение;
	КонецЦикла; 
	
	Возврат Неопределено;
КонецФункции // ПолучитьпериодическийРеквизит()

//+++Чирков Д.С. 1.10.2025
Функция УдалитьОбъектПоСсылке(Ссылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	Попытка	
		Ссылка.ПолучитьОбъект().Удалить();			
	Исключение	                            
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ОписаниеОшибки());
	КонецПопытки;
	Возврат Результат;
КонецФункции //УдалитьОбъект(Ссылка) Экспорт
//---Чирков Д.С. 1.10.2025

//Кухарь 18.11.16 начало
//Для отбора
//Функция ПолучитьГрупповойПериодическийРеквизит(Ссылка,ИмяРеквизита,Знач Дата2=Неопределено)	Экспорт
 Функция ПолучитьГрупповойПериодическийРеквизит(Ссылка,ИмяРеквизита,Знач Дата2=Неопределено,Отбор=Неопределено)	Экспорт

//Кухарь 18.11.16 конец

	Значение=Неопределено;
	
	Если Ссылка<>Неопределено И НЕ Ссылка.Пустая() Тогда		
		//Кухарь 18.11.16 начало
		//Для отбора
		//Значение=ПолучитьПериодическийРеквизит(Ссылка,ИмяРеквизита,Дата2);
		Значение=ПолучитьПериодическийРеквизит(Ссылка,ИмяРеквизита,Дата2,,,Отбор);
		//Кухарь 18.11.16 конец


		Если Значение=Неопределено И Ссылка.Уровень()<>0 Тогда
			//Кухарь 18.11.16 начало
			//для отбора
			//Значение=ПолучитьГрупповойПериодическийРеквизит(Ссылка.Родитель,ИмяРеквизита,Дата2);	
			Значение=ПолучитьГрупповойПериодическийРеквизит(Ссылка.Родитель,ИмяРеквизита,Дата2,Отбор);	
			//Кухарь 18.11.16 конец
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Значение;
КонецФункции // ПолучитьГрупповойПериодическийРЕквизит()



Функция ПолучитьСтруктуруПериодическихРеквизитов(Вид) Экспорт
	ПериодическиеРеквизиты=Новый Структура;
	Для Каждого Реквизит Из Метаданные.Справочники[Вид].Реквизиты Цикл
		Если Найти(Реквизит.Комментарий,"(Периодический")<>0 Тогда
			ПериодическиеРеквизиты.Вставить(Реквизит.Имя);
		КонецЕсли;	
	КонецЦикла; 
	//крохин начало 12.03.2013
	//периодические ревизиты прописываем в коде, чтобы не плодить в справочнике
	Если Вид = "Номенклатура" тогда
	ПериодическиеРеквизиты.Вставить("Декларация");
    КонецЕсли;
    //крохин конец 12.03.2013

	Возврат ПериодическиеРеквизиты;
КонецФункции // ПолучитьПериодическиеРеквизиты()
//Данилова Е.В. 25.03.2025 добавлен параметр Дополнительные свойства
Процедура УстановитьРеквизитыОбъекта(СсылкаНаОбъект,Реквизиты,РежимЗаписи=Неопределено,РежимЗагрузки=Ложь,НеПроверятьДЗР=Ложь,ДополнительныеСвойстваОбъекта = неопределено) Экспорт
	Если РежимЗаписи=Неопределено Тогда
		РежимЗаписи=РежимЗаписиДокумента.Запись;	
	КонецЕсли;
	
	Объект=СсылкаНаОбъект.ПолучитьОбъект();	
	
	Если Объект=Неопределено Тогда Возврат КонецЕсли; 
	
	Попытка
	    Объект.мЗаписьБезКонтроля=Истина;		
	Исключение	
	КонецПопытки;
	Если НеПроверятьДЗР Тогда
		Объект.ДополнительныеСвойства.Вставить("НеПроверятьДЗР",Истина);		
	КонецЕсли; 
	
	Если РежимЗагрузки Тогда
		Объект.ОбменДанными.Загрузка=Истина;	
	КонецЕсли; 
	
	Для Каждого Элемент Из Реквизиты Цикл
		Если Объект[Элемент.Ключ]<>Элемент.Значение Тогда
			Объект[Элемент.Ключ]=Элемент.Значение;			
		КонецЕсли;		
	КонецЦикла;
	//++Данилова Е.В. 25.03.2025
	Если ДополнительныеСвойстваОбъекта <> неопределено
		И ТипЗнч(ДополнительныеСвойстваОбъекта) = Тип("Структура") Тогда
		
		Для каждого ДопСвойство  Из ДополнительныеСвойстваОбъекта Цикл
			
			Объект.ДополнительныеСвойства.Вставить(ДопСвойство.Ключ,ДопСвойство.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	//--Данилова Е.В. 25.03.2025
	
	Если Объект.Модифицированность() Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
			Объект.Записать(РежимЗаписи);
		Иначе
			Объект.Записать();		
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры


//Кухарь 06.09.19 начало
//тссс...
Процедура ЗаписатьДопИнфо (ВидИнфо,ЗначениеИнфо) Экспорт 
	ЗаписьВРег=РегистрыСведений.ДопИнфо.СоздатьНаборЗаписей();
	ЗаписьВРег.Отбор.ВидИнфо.Значение=ВидИнфо;
	ЗаписьВРег.Отбор.ВидИнфо.использование=истина;		
	ЗаписьВРег.Прочитать();
	ЗаписьВРег.Очистить();
	СтрЗаписей=ЗаписьВРег.Добавить();
	СтрЗаписей.ВидИнфо=ВидИнфо;
	СтрЗаписей.ЗначениеИнфо=ЗначениеИнфо;
	ЗаписьВРег.Записать();
	
	
КонецПроцедуры

Функция ПрочитатьДопИнфо (ВидИнфо) Экспорт
	ЗаписьВРег=РегистрыСведений.ДопИнфо.СоздатьНаборЗаписей();
	ЗаписьВРег.Отбор.ВидИнфо.Значение=ВидИнфо;
	ЗаписьВРег.Отбор.ВидИнфо.использование=истина;		
	ЗаписьВРег.Прочитать();
	для каждого СтрЗаписей из ЗаписьВРег цикл
		Возврат СтрЗаписей.ЗначениеИнфо;
	КонецЦикла;
	возврат "";
КонецФункции
//Кухарь 06.09.19  конец


//Кухарь 13.12.19 начало
//Для анализа использования
Процедура ЗаписатьДатуИспользованияВнешнегоОтчёта (ВнешнийОтчётСсылка)  Экспорт
	ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьМенеджерЗаписи();	
	ЗапВРег.ЗначениеРеквизита=ТекущаяДата();
	ЗапВРег.ИмяРеквизита="ДатаПоследнегоИспользования";
	ЗапВРег.Справочник=ВнешнийОтчётСсылка;
	ЗапВРег.Записать();
КонецПроцедуры
//Кухарь 13.12.19 конец

//Тимофеев Ю.А. 30.10.2024
//получение таблицы параметров регламентного задания по ключу
Функция ВернутьПараметрыРегламентногоЗадания(нужныйКлюч) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", нужныйКлюч);
				
	МоеРегЗадание=РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
    ТаблицаПараметров= МоеРегЗадание[0].Параметры[0];
	
	Возврат ТаблицаПараметров; 
	
КонецФункции
//Тимофеев Ю.А. 30.10.2024
